documents/c4/mermaid/Repositories.mmd
graph TB
  linkStyle default fill:#ffffff

  subgraph diagram ["Trade Loan Service - Trade Loan Application - Components"]
    style diagram fill:#ffffff,stroke:#ffffff

    12[("<div style='font-weight: bold'>PostgreSQL Database</div><div style='font-size: 70%; margin-top: 0px'>[Container: PostgreSQL 18]</div><div style='font-size: 80%; margin-top:10px'>Loan data storage</div>")]
    style 12 fill:#438dd5,stroke:#2e6295,color:#ffffff

    subgraph 11 ["Trade Loan Application"]
      style 11 fill:#ffffff,stroke:#2e6295,color:#2e6295

      126[("<div style='font-weight: bold'>InstallmentScheduleRepositoryAdapter</div><div style='font-size: 70%; margin-top: 0px'>[Component: Spring Data JPA]</div><div style='font-size: 80%; margin-top:10px'>InstallmentSchedule<br />persistence adapter</div>")]
      style 126 fill:#5c6bc0,stroke:#404a86,color:#ffffff
      127[("<div style='font-weight: bold'>TradeLoanArrangementRepositoryAdapter</div><div style='font-size: 70%; margin-top: 0px'>[Component: Spring Data JPA]</div><div style='font-size: 80%; margin-top:10px'>TradeLoanArrangement<br />persistence adapter</div>")]
      style 127 fill:#5c6bc0,stroke:#404a86,color:#ffffff
      128[("<div style='font-weight: bold'>TradeLoanFacilityRepositoryAdapter</div><div style='font-size: 70%; margin-top: 0px'>[Component: Spring Data JPA]</div><div style='font-size: 80%; margin-top:10px'>TradeLoanFacility persistence<br />adapter</div>")]
      style 128 fill:#5c6bc0,stroke:#404a86,color:#ffffff
      129[("<div style='font-weight: bold'>TradeLoanTypeRepositoryAdapter</div><div style='font-size: 70%; margin-top: 0px'>[Component: Spring Data JPA]</div><div style='font-size: 80%; margin-top:10px'>TradeLoanType persistence<br />adapter</div>")]
      style 129 fill:#5c6bc0,stroke:#404a86,color:#ffffff
      130[("<div style='font-weight: bold'>JpaTradeInstallmentScheduleQueryAdapter</div><div style='font-size: 70%; margin-top: 0px'>[Component: Spring Data JPA]</div><div style='font-size: 80%; margin-top:10px'>TradeInstallmentSchedule<br />query adapter</div>")]
      style 130 fill:#5c6bc0,stroke:#404a86,color:#ffffff
      131[("<div style='font-weight: bold'>JpaTradeLoanArrangementQueryAdapter</div><div style='font-size: 70%; margin-top: 0px'>[Component: Spring Data JPA]</div><div style='font-size: 80%; margin-top:10px'>TradeLoanArrangement query<br />adapter</div>")]
      style 131 fill:#5c6bc0,stroke:#404a86,color:#ffffff
      132[("<div style='font-weight: bold'>JpaFacilityQueryAdapter</div><div style='font-size: 70%; margin-top: 0px'>[Component: Spring Data JPA]</div><div style='font-size: 80%; margin-top:10px'>Facility query adapter</div>")]
      style 132 fill:#5c6bc0,stroke:#404a86,color:#ffffff
      133[("<div style='font-weight: bold'>JpaTradeLoanTypeQueryAdapter</div><div style='font-size: 70%; margin-top: 0px'>[Component: Spring Data JPA]</div><div style='font-size: 80%; margin-top:10px'>TradeLoanType query adapter</div>")]
      style 133 fill:#5c6bc0,stroke:#404a86,color:#ffffff
    end

    126-. "<div>Reads/Writes</div><div style='font-size: 70%'>[JDBC/HikariCP]</div>" .->12
    127-. "<div>Reads/Writes</div><div style='font-size: 70%'>[JDBC/HikariCP]</div>" .->12
    128-. "<div>Reads/Writes</div><div style='font-size: 70%'>[JDBC/HikariCP]</div>" .->12
    129-. "<div>Reads/Writes</div><div style='font-size: 70%'>[JDBC/HikariCP]</div>" .->12
    130-. "<div>Reads/Writes</div><div style='font-size: 70%'>[JDBC/HikariCP]</div>" .->12
    131-. "<div>Reads/Writes</div><div style='font-size: 70%'>[JDBC/HikariCP]</div>" .->12
    132-. "<div>Reads/Writes</div><div style='font-size: 70%'>[JDBC/HikariCP]</div>" .->12
    133-. "<div>Reads/Writes</div><div style='font-size: 70%'>[JDBC/HikariCP]</div>" .->12
  end
